# coding: utf-8

require './fig.rb'
require './figSet.rb'

# 戦略
# たて4×よこ3のシートから2枚切り取ることを考える。
# 切り取り方は、
#       ■
# ■■ と ■ の2種類ある。
# 4×3のシートの左上から ■■をスライドさせていくと、、
# たて方向には3回動かせる(=置いた場所と合わせると、4パターン)
# よこ方向には1回動かせる(=置いた場所と合わせると、2パターン)
# つまり、たて4-1+1=4, よこ3-2+1=2 パターンで、計8パターンある
# →x*yのシートからa*bを切り取るのは、(x-a+1)*(y-b+1) パターンある。これを切り取るかたち毎に計算して足し合わせる。
#
# 計算量
# ・切り取りは5枚までと割り切って考えるけど、そのぶん速い。
# ・シートの大きさに依存しない
# ・切り取りサイズとの関係は…？ 1,2,6,19,63,…

# 人力検索
def count(row, column, cutSize)
  # 切り取る数とパターン。5以上は考える気にならない…
  patternHash = {
    1 => [[1, 1]],    # ■

    2 => [[1, 2], [2, 1]],  # ■■

    3 => [[1, 3], [3, 1],                  # ■■■    ■
          [2, 2], [2, 2],[2, 2], [2, 2]],  #       ■■

    4 => [[1, 4], [4, 1],                  # ■■■■     ■  
          [2, 3], [2, 3], [3, 2], [3, 2],  #          ■■■     ■ 
          [2, 3], [2, 3], [3, 2], [3, 2],  #                 ■■■      ■
          [2, 3], [2, 3], [3, 2], [3, 2],  #          ■■            ■■■
          [2, 3], [3, 2],                  #           ■■     ■■
          [2, 3], [3, 2],                  #                 ■■     ■■
          [2, 2]],                         #                        ■■

    5 => [[1, 5], [5, 1],
          [2, 4], [2, 4], [4, 2], [4, 2],
          [2, 4], [2, 4], [4, 2], [4, 2],
          [2, 4], [2, 4], [4, 2], [4, 2],
          [2, 4], [2, 4], [4, 2], [4, 2],
          [2, 4], [2, 4], [4, 2], [4, 2],
          [2, 4], [2, 4], [4, 2], [4, 2],
          [3, 3], [3, 3], [3, 3], [3, 3],
          [3, 3], [3, 3], [3, 3], [3, 3],
          [3, 3], [3, 3], [3, 3], [3, 3],
          [3, 3], [3, 3], [3, 3], [3, 3],
          [3, 3], [3, 3], [3, 3], [3, 3],
          [3, 3], [3, 3],
          [3, 3], [3, 3],
          [3, 3],
          [3, 2], [3, 2], [2, 3], [2, 3],
          [3, 2], [3, 2], [2, 3], [2, 3],
          [3, 2], [3, 2], [2, 3], [2, 3]]
  }

  total = 0
  for pattern in patternHash[cutSize]
    if row >= pattern[0] && column >= pattern[1]
      total += (row - pattern[0] + 1) * (column - pattern[1] + 1)
    end
  end

  return total
end

# 機械検索
def count2(row, column, cutSize)
  # Seed
  s1 = Array.new(1){Array.new(1).fill(true)}
  figSet = FigSet.new([Fig.new(s1)])

  # 指定枚数のFigSetをつくる
  if cutSize > 1
    (cutSize - 1).times do
      figSet = figSet.plusOne
    end
  end

  total = 0
  for pattern in figSet.getPattern
    if row >= pattern[0] && column >= pattern[1]
      total += (row - pattern[0] + 1) * (column - pattern[1] + 1)
    end
  end

  return total
end
